app/controllers/users_controller.rb

  def create
    User.create(user_params)
---
INSERT INTO `users` (`name`, `age`, `created_at`, `updated_at`) VALUES ('taro', 25, '2020-01-02 15:40:28', '2020-01-02 15:40:28')

  def update
    user = User.find(params[:id])
    user.update(user_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
UPDATE `users` SET `age` = 26, `updated_at` = '2020-01-02 17:15:38' WHERE `users`.`id` = 3

  def destroy
    user = User.find(params[:id])
    user.delete
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 4